[
{
    "id": "js_resume",
    "title": "Coder: an interactive history",
    "focus_date": "2001-01-01 12:00:00",
    "initial_zoom": 45,
    "image_lane_height": 50,

    "events": [

    {
		"id": "jsr-a1",
		"title": "line forecasting",
        "description": "This replaced a tedious manual calculation process (done by hand on a 10-key calculator). The real bonus was that the output was formatted for direct submission to another batch process. This removed the need for manually transcribing data and eliminated keystroke errors. My first systm integration",
		"startdate": "1975-09-01 00:00:00",
        "high_threshold": 50,
        "importance": 50,
		"date_display": "month",
		"icon": "circle_red.png"
	},
    {
		"id": "jsr-a2",
		"title": "maintenance scheduling",
        "description": "This was a commercial application that handled equipment inventory and scheduled maintenance for very large mechanical and electrical installations (hospitals, campuses, commercial buildings). Written during the early days of the PC, when those devices were a novelty and viewed skeptically by computer departments -- but viewed as magic by others.<br>This was before the days of libraries and windowing systems. So I developed a window 'template' that made it possible to generate a screen layout from configuration data.",
		"startdate": "1983-01-01 00:00:00",
        "high_threshold": 50,
        "importance": 50,
		"date_display": "month",
		"icon": "circle_red.png"
	},
    {
		"id": "jsr-a3",
		"title": "shop aids",
        "description": "For custom circuit boards there are still manual steps and assembly technicians require specific instructions for each board. This system replaced paper manuals with online step-by-step instructions displayed on a graphics terminal. The 'cool' factor was a bitmap picture of the circuit board that highlighted the assembly instructions -- this was done on a character terminal with primitive memory mapped graphics -- the data was mapped from a CAD system and combined with annotations.",
		"startdate": "1986-02-01 00:00:00",
        "high_threshold": 50,
        "importance": 50,
		"date_display": "month",
		"icon": "circle_red.png"
	},
    {
		"id": "jsr-a4",
		"title": "machine automation",
        "description": "Possibly the most fun project -- getting to watch a robot run my software. Inserting ICs and components on a circuit board is done by machine and previously machines were programmed manually with a blank board and a large X-Y plotter. I developed an application that took CAD data directly from the designers, performed the required coordinate transformations, generated the insertion machine code, and loaded directly into the equipment (instead of paper tape). The time to generate automation programs was reduced from 8-12 hours to 1 minute and errors virtually eliminated.",
		"startdate": "1987-12-01 00:00:00",
        "high_threshold": 50,
        "importance": 50,
		"date_display": "month",
		"icon": "circle_red.png"
	},
    {
		"id": "jsr-a5",
		"title": "pricing system",
        "description": "The golden years and the last of the great waterfall projects. This was my first large team project to generate quotations for large telephone switch systems. I led/mentored ex-cobol mainframe developers in UNIX and C. It was the company's first large client-server application and run over TCP/IP.<br>The key challenge was implementing the myriad pricing policies that had been negotiated. The solution was a forward-chaining inference engine (rules engine) that was linked into the application that allowed defining any pricing strategy imaginable (and salesmen can be very imaginative). My one experience with AI.",
		"startdate": "1990-05-01 00:00:00",
        "high_threshold": 50,
        "importance": 50,
		"date_display": "month",
		"icon": "circle_red.png"
	},
    {
		"id": "jsr-a6",
		"title": "global pricing system",
        "description": "The first interative development project on a grand scale -- with an equally grand failure. This was the company's first attempt at a large object-oriented application. Some things were done right (we received excellent training beforehand); others were done poorly and have been well documented in Dilbert. There were dark days, but design skills acquired while learning Smalltalk have served well since then.",
		"startdate": "1993-10-01 00:00:00",
        "high_threshold": 50,
        "importance": 50,
		"date_display": "month",
		"icon": "circle_red.png"
	},
    {
		"id": "jsr-a7",
		"title": "odds & ends",
        "description": "From the global project wreckage a group of mentors was formed to mentor other groups in object-oriented design, development, and tools. We worked with other IT groups to train them and build actual systems. We moved away from Smalltalk and it's been Java ever since. The group expanded from mentoring to managing the re-use library and then to technical standards (my role).<br>Eventually I became involved in the deployment of the corporate document management system and worked on system design, performance tuning, system interfaces, and end-user training. A little of evertything. So from a single large scale project to a variety of small efforts that had to be run in parallel.",
		"startdate": "1995-10-01 00:00:00",
		"enddate": "2007-11-01 00:00:00",
        "high_threshold": 50,
        "importance": 50,
		"date_display": "month",
        "span_color": "indianred",
		"icon": "circle_red.png"
	},
    {
		"id": "jsr-a8",
		"title": "workflows",
        "description": "Automating business processes, collecting requirements, and implementing in a workflow engine. Useful yes, glamorous and exciting -- not really. But a very good way to learn what the business was about.",
		"startdate": "2008-06-01 00:00:00",
        "high_threshold": 50,
        "importance": 50,
		"date_display": "month",
		"icon": "circle_red.png"
	},
    {
		"id": "jsr-a9",
		"title": "process integration",
        "description": "No system is an island anymore. The challenge now is to automate data and process exchange between very disparate systems.<br>This project presented interesting technical challenges. I built a web for moving content and workflows into the target system, but no one on the client system knew how to build a SOAP client. So I built the client end as well using Java and packaging in an Oracle stored procedure that ran directly from the database. The client system only had to execute a SQL statement to effect the web service and transfer the data.",
		"startdate": "2009-06-01 00:00:00",
        "high_threshold": 50,
        "importance": 50,
		"date_display": "month",
		"icon": "circle_red.png"
	},
    {
		"id": "jsr-a10",
		"title": "portlets and web pages",
        "description": "Part of another large scale project. Learned a lot, worked hard, but it was a death march.",
		"startdate": "2010-06-01 00:00:00",
        "high_threshold": 50,
        "importance": 50,
		"date_display": "month",
		"icon": "circle_red.png"
	},
    {
		"id": "jsr-a11",
		"title": "Peoplesoft integration",
        "description": "Technical lead for a project to integrate Peoplsoft with a document management system. The interesting component was a Windows service written in C# and .NET that scanned incoming faxes (TIF images) and decoded 3of9 barcodes to determine filing.",
		"startdate": "2011-06-01 00:00:00",
        "high_threshold": 50,
        "importance": 50,
		"date_display": "month",
		"icon": "circle_red.png"
	},
    {
		"id": "jsr-a12",
		"title": "web services",
        "description": "Designed and implemented a web service (SOAP) for integration with the corporate document respository. It supported document submission and retrieval.",
		"startdate": "2011-10-01 00:00:00",
        "high_threshold": 50,
        "importance": 50,
		"date_display": "month",
		"icon": "circle_red.png"
	},
    {
		"id": "jsr-a13",
		"title": "more web services",
        "description": "More document respository integration, but in this case existing services had to be extended and new ones developed to allow routing to various target systems. ",
		"startdate": "2014-02-01 00:00:00",
        "high_threshold": 50,
        "importance": 50,
		"date_display": "month",
		"icon": "circle_red.png"
	},
    {
		"id": "jsr-a14",
		"title": "web applications",
        "description": "I've done the odd webpage in HTML or JSP for small utility web tools. This was taking over and extending an existing application where the server side was written in Java and the client as a JSP site with an extensive custom Javascript framework.",
		"startdate": "2012-12-01 00:00:00",
        "high_threshold": 50,
        "importance": 50,
		"date_display": "month",
		"icon": "circle_red.png"
	},
    {
		"id": "jsr-a15",
		"title": "bespoke web applications",
        "description": "So from maintaining existing applications, I moved to designing an entirely new system composed of multiple web services (now using REST) and an end-user web interface. Responsible for some coding, application review, as well as managing off-shore developers. <br>The user interface was developed using the VAADIN UI framework. This actually makes user applications a joy to design. An MVP pattern was used that allowed a return to 'traditional' development, but with a web deployment.",
		"startdate": "2013-08-01 00:00:00",
        "high_threshold": 50,
        "importance": 50,
		"date_display": "month",
		"icon": "circle_red.png"
	},
    {
		"id": "jsr-a16",
		"title": "even more web services",
        "description": "Bigger, better, faster, and delivered on time.",
		"startdate": "2014-05-01 00:00:00",
        "high_threshold": 50,
        "importance": 50,
		"date_display": "month",
		"icon": "circle_red.png"
	},
    {
		"id": "jsr-a17",
		"title": "Open Text Content Server 9.x, 10.x, 20.x (Livelink)",
        "description": "Livelink was adopted as the corporate standard for content management and I was identified as the lead technical resource for the global deployment. The final deployment was three large Livelink clusters with over 30 servers and 3 terabytes of document storage.<br>My initial role was server engineering, capacity planning, and then performance improvement. This moved on to custom module and feature development in oscript. I've done extensive work with modules, workflows, event handlers, and reporting. Now most of my work is integration with other systems by designing and implementing custom web services that integrate with Content Server 10 API.",
		"startdate": "1997-12-01 00:00:00",
		"enddate": "now",
        "high_threshold": 50,
        "importance": 50,
		"date_display": "month",
        "span_color": "indianred",
		"icon": "circle_red.png"
	},
    {
		"id": "jsr-a18",
		"title": "SPA (single-page apps)",
        "description": "Have developed a number of single-page apps (SPA) for rapid delivery of point solutions. Using existing services and UI frameworks like Kendo provide a lightweight, responsive solution.",
		"startdate": "2015-06-01 00:00:00",
		"enddate": "now",
        "high_threshold": 50,
        "importance": 50,
		"date_display": "month",
        "span_color": "indianred",
		"icon": "circle_red.png"
	},
    {
		"id": "jsr-1",
		"title": "South Central Bell",
		"startdate": "1975-09-01 00:00:00",
		"enddate": "1982-05-01 00:00:00",
        "span_color": "#58a0dc",
        "css_class": "blurb",
        "high_threshold": 50,
        "importance": 50,
		"date_display": "month",
		"icon": "flag_blue.png",
        "link": "career/j_scb.html",
        "modal_type": "link-iframe"
	},
	{
		"id": "jsr-2",
		"title": "Jeffoat Mechanical Services",
		"startdate": "1982-05-01 00:00:00",
		"enddate": "1985-06-01 00:00:00",
        "span_color": "#58a0dc",
        "high_threshold": 50,
        "importance": 50,
		"date_display": "month",
		"icon": "flag_blue.png",
        "link": "career/j_jeffcoat.html",
        "modal_type": "link-iframe"

	},
	{
		"id": "jsr-3",
		"title": "Nortel Networks",
		"startdate": "1985-06-01 00:00:00",
		"enddate": "2007-12-01 00:00:00",
        "span_color": "#58a0dc",
        "high_threshold": 50,
        "importance": 50,
		"date_display": "month",
		"icon": "flag_blue.png",
        "link": "career/j_nortel.html",
        "modal_type": "link-iframe"

	},
	{
		"id": "jsr-4",
		"title": "PPD, Inc.",
		"startdate": "2008-01-31 00:00:00",
		"enddate": "2011-01-31 00:00:00",
        "span_color": "#58a0dc",
        "high_threshold": 50,
        "importance": 50,
		"date_display": "month",
		"icon": "flag_blue.png",
        "link": "career/j_ppd.html",
        "modal_type": "link-iframe"

	},
	{
		"id": "jsr-5",
		"title": "IQVIA (Quintiles)",
		"startdate": "2011-01-31 00:00:00",
		"enddate": "now",
        "span_color": "#58a0dc",
        "high_threshold": 50,
        "importance": 50,
		"date_display": "month",
		"icon": "flag_blue.png",
        "link": "career/j_quintiles.html",
        "modal_type": "link-iframe"

	},

	{
		"id": "jsr-t1",
		"title": "FORTRAN",
		"startdate": "1972-01 00:00:00",
		"enddate": "1982-01 00:00:00",
        "description": "Started coding with punched cards and moved on to the latest technology -- online timesharing (with a teletype and modem). First useful applications developed in FORTRAN. Also learned the importance of good design to support maintenance and future requirements (spaghetti code can be very hard to digest later).",
        "span_color": "#ffd700",
        "high_threshold": 60,
        "importance": 50,
		"date_display": "year",
		"icon": "circle_yellow.png"
	},
	{
		"id": "jsr-t2",
		"title": "BASIC",
		"startdate": "1973-01 00:00:00",
		"enddate": "1986-01 00:00:00",
        "description": "A PDP 11/40, a teletype, 8K of RAM, and paper tape. What else could you want? Once the PC appeared, found I could make a living coding.",
        "span_color": "#ffd700",
        "high_threshold": 60,
        "importance": 50,
		"date_display": "year",
		"icon": "circle_yellow.png"
	},
	{
		"id": "jsr-t3",
		"title": "C",
		"startdate": "1983-01 00:00:00",
		"enddate": "2003-01 00:00:00",
        "description": "In the beginning it was just me and the white book (K&R); but a door to everything. Spent a long part of career writing C, but it has been a while (except for the occasional C# now).",
        "span_color": "#ffd700",
        "high_threshold": 60,
        "importance": 50,
		"date_display": "year",
		"icon": "circle_yellow.png"
	},
	{
		"id": "jsr-t4",
		"title": "Oracle",
		"startdate": "1989-01 00:00:00",
		"enddate": "now",
        "description": "There have been a couple other relational DBs in my life, but Oracle is still the main one. It's all about the SQL. Have coded PL/SQL and embedded Java applicatsions in the Oracle server.<br>Extensive experience in relational database design.",
        "span_color": "#ffd700",
        "high_threshold": 60,
        "importance": 50,
		"date_display": "year",
		"icon": "circle_yellow.png"
	},
	{
		"id": "jsr-t5",
		"title": "Smalltalk",
		"startdate": "1994-01 00:00:00",
		"enddate": "2006-01 00:00:00",
        "description": "This is where objects became real. The Smalltalk world was a little off the main stream, but it was the basis for learning proper OO design, patterns, and iterative development. The instant gratification was good too. (Java owes Smalltalk a lot.)",
        "span_color": "#ffd700",
        "high_threshold": 60,
        "importance": 50,
		"date_display": "year",
		"icon": "circle_yellow.png"
	},
	{
		"id": "jsr-t6",
		"title": "Java",
		"startdate": "1995-06 00:00:00",
		"enddate": "now",
        "description": "Things have come a long way since animated Duke applets in a browser. Java is my main coding expression these days. I've built a number of front-end applications, but backend services and system integration are where I like to work.",
        "span_color": "#ffd700",
        "high_threshold": 60,
        "importance": 50,
		"date_display": "year",
		"icon": "circle_yellow.png"
	},
	{
		"id": "jsr-t7",
		"title": "HTML, CSS, Javascript, XML/XSL, AJAX, frameworks",
		"startdate": "1997-01 00:00:00",
		"enddate": "now",
        "description": "Confession time here -- when I first saw a website in Mozilla -- I thought it was a fad. Now I'm posting a resume in HTML. Since then I've touched it all: Javascript single-page applications with jQuery and the supporting cast of frameworks all the way to server side applications using everything from plain JSP to complete UI frameworks (Vaadin).",
        "span_color": "#ffd700",
        "high_threshold": 60,
        "importance": 50,
		"date_display": "year",
		"icon": "circle_yellow.png"
	},
	{
		"id": "jsr-t8",
		"title": "web services (SOAP, REST)",
		"startdate": "2009-01 00:00:00",
		"enddate": "now",
        "description": "Have developed new web services and extended existing ones using a variety of frameworks (Axis 1/2, Apache CXF, and even Microsoft WCF). While most of my work has been service development there have been a couple client applications in Java and Windows .NET.",
        "span_color": "#ffd700",
        "high_threshold": 60,
        "importance": 50,
		"date_display": "year",
		"icon": "circle_yellow.png"
	},
	{
		"id": "jsr-t9",
		"title": "C#, .NET",
		"startdate": "2011-01 00:00:00",
		"enddate": "2017-01 00:00:00",
        "description": "VisualStudio is still not my favorite IDE, but we can work together when required. So my old C skills have slightly re-incarnated as C#.",
        "span_color": "#ffd700",
        "high_threshold": 60,
        "importance": 50,
		"date_display": "year",
		"icon": "circle_yellow.png"
	},
	{
		"id": "jsr-p1",
		"title": "UNIX, BSD, Linux",
		"startdate": "1983-01 00:00:00",
		"enddate": "2008-01 00:00:00",
        "description": "First love? Maybe. It is still my favorite development platform. Even exiled to the land of Windows I keep the GNU tools available so that I can run the shell for command line work. You never know when you might need a quick AWK script. The occasional Ubuntu install comes my way.",
        "span_color": "#00B000",
        "high_threshold": 60,
        "importance": 50,
		"date_display": "year",
		"icon": "star_green.png"
	},
	{
		"id": "jsr-p2",
		"title": "PC-DOS, Windows Server ...",
		"startdate": "1984-01 00:00:00",
		"enddate": "now",
        "description": "The platform I love to hate. Have still not escaped. Can configure a server/IIS and bend it to my will -- but I don't have to enjoy it.",
        "span_color": "#00B000",
        "high_threshold": 60,
        "importance": 50,
		"date_display": "year",
		"icon": "star_green.png"
	}

],

    "tags": {
                "career": 2,
                "tech": 2,
                "project": 2, 
                "other": 1
            },

    "legend": [
                { "title": "Career", "icon": "flag_blue.png" },
                { "title": "Technology", "icon": "circle_yellow.png"},
                { "title": "Platforms", "icon": "star_green.png"},
                { "title": "Projects", "icon": "circle_red.png"}
            ]
         
    }
]